"""Дана последовательность из N целых чисел и число
K. Необходимо сдвинуть всю последовательность
(сдвиг - циклический) на K элементов вправо, K –
положительное число.
Input: [1, 2, 3, 4, 5] k = 2
Output: [4, 5, 1, 2, 3]"""

a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
k = 2
print(a[-k:len(a)] + a[:-k])


"""2 способ
lst = [1, 2, 3, 4, 5]
k = 2
for i in range(k):
    lst.insert(0, lst.pop(-1))
print(lst)"""