"""Задача 26:  
Напишите программу, которая на вход принимает два числа
A и B, и возводит число А в целую степень B с помощью рекурсии.
*Пример:*
A = 3; B = 5 -> 243 (3⁵)
    A = 2; B = 3 -> 8 """


A = int(input("Введите число А: "))
B = int(input("Введите число B: "))

def pow(A, B):
    if B == 1:
        return A
    if B != 1:
        return (A*pow(A, B-1))
print(f"(Число {A} в степени {B} равно --> {pow(A, B)}")

