"""Ваня и Петя поспорили, кто быстрее решит
следующую задачу: “Задана последовательность
неотрицательных целых чисел. Требуется определить
значение наибольшего элемента
последовательности, которая завершается первым
встретившимся нулем (число 0 не входит в
последовательность)”. Однако 2 друга оказались не
такими смышлеными. Никто из ребят не смог до
конца сделать это задание. Они решили так: у кого
будет меньше ошибок в коде, тот и выиграл спор. За
помощью товарищи обратились к Вам, студентам."""
"""Ваня:

n = int(input())
max_number = 1000
while n != 0:
 n = int(input())
 if max_number > n:
 max_number = n
print(max_number)
Петя:
n = int(input())
max_number = -1
while n < 0:
 n = int(input())
 if max_number < n:
 n = max_number
print(n)"""

n = int(input())  #0 ошибок
max_number = 1000 # ошибка
while n != 0: # > 0 строго больше нуля
 n = int(input())
 if max_number > n: # ошибка, знак д.б. <
 max_number = n  # нет отступа
print(max_number)

n = int(input()) #100
max_number = -1 # ошибка
while n < 0: # ошибка знак д.б. >
 n = int(input()) #50
 if max_number < n:
 n = max_number # поменять местами
print(n)