"""Даны два массива чисел. Требуется вывести те элементы
первого массива (в том порядке, в каком они идут в первом
массиве), которых нет во втором массиве. Пользователь вводит
число N - количество элементов в первом массиве, затем N
чисел - элементы массива. Затем число M - количество
элементов во втором массиве. Затем элементы второго массива
Ввод: 
7 --> 3 1 3 4 2 4 12
6 --> 4 15 43 1 15 1 (каждое число вводится с новой строки)
Вывод:
3 3 2 12"""

import random
count_list_1 = int(input("Введите кол-во элементов 1 списка: "))
list_1 = [random.randint(1,10) for _ in range(count_list_1)]
print(list_1)

count_list_2 = int(input("Введите кол-во элементов 2 списка: "))
list_2 = [random.randint(1,10) for _ in range(count_list_2)]
print(list_2)

temp_list = []
for i in list_1:
    if i not in list_2:
        temp_list.append(i)
print(temp_list)
