"""Два различных натуральных числа n и m называются
дружественными, если сумма делителей числа n
(включая 1, но исключая само n) равна числу m и
наоборот. Например, 220 и 284 – дружественные числа.
По данному числу k выведите все пары дружественных
чисел, каждое из которых не превосходит k. Программа
получает на вход одно натуральное число k, не
превосходящее 10 в 5 степени
. Программа должна вывести все
пары дружественных чисел, каждое из которых не
превосходит k. Пары необходимо выводить по одной в
строке, разделяя пробелами. Каждая пара должна быть
выведена только один раз (перестановка чисел новую
пару не дает).
Ввод: 
300
Вывод:
220 284  Найти все делители 1 числа, сложить их и получить 2 число и наоборот"""

def divisor(x):
    return sum([i for i in range(1,x//2+1) if x%i == 0])

x = int(input("Pls enter the upper limit: "))

for i in range(1, x):
    if divisor(divisor(i)) == i and i<divisor(i):
        print((i,divisor(i)))







"""numb = int(input("Введите целое число: "))
print("Результат:", end = " ")
for i in range(numb - 1, 1, -1):
     if (numb % i == 0):      
print(i, end = " ")"""
